# ------------------------------------------------------------------------------------------------
print('Глобальные функциональности')
# ------------------------------------------------------------------------------------------------

# 1.1) Сохранение пользователей в БД и назначение им роли (покупатель, сотрудник, владелец)
# 1.2) Вывод пользователю основного меню
# 1.3) Создание в БД таблицы для сохранения данных из корзины для всех пользователей
# 2) Заливка в БД таблицы Excel с ценами
# 3) Заливка в БД таблицы Excel с остатками
# 4) Заливка в БД таблицы Excel с нотами/описанием
# 4) Демонстрация цен: списком и по категориям


# ------------------------------------------------------------------------------------------------
print('Детализация отдельных пунктов глобальной функциональности')
# ------------------------------------------------------------------------------------------------

# 1.2 Типичное меню пользователя:
# - Корзина (в корзину добавляются ароматы, объем добавляется внутри корзины)
# - Подобрать аромат (по бюджету, по нотам, по стойкости, по событию)
# - Все цены
# - Показать специальные предложения (сеты, остатки во флаконах)
# - Условия доставки
# - Мои заказы
# - Записаться на подбор аромата

# 1.3 Меню корзины:
# = Очистить корзину
# - Оформить заказ
# - Выход в главное меню


# ------------------------------------------------------------------------------------------------
print('Попытка обрисовать архитектуру, добавление задач, отметка о закрытии задач, реформат и т.д.')
# ------------------------------------------------------------------------------------------------

# 1.1 Каждый юзер, нажавший start заносятся в БД, одновременно статус "ожидание регистрации владельца/сотрудника":
# TABLE_NAME = 'users'
# REGISTRATION_TABLE = ('telegram_id', 'telegram_username', 'user_role', 'state_in_bot', 'salesperson_comment')
# 'user_role' - используется для разделения владельца, сотрудника и покупателя

# Если после приветственного сообщения бота юзер введет секретную фразу (пароль):
# обнулится его статус и юзер получит роль
# Если введенная юзером секретная фраза не соответствует ни владельцу, ни сотруднику,
# юзер снимет статус и получит роль покупателя и откроет
# # для себя меню покупателя.

# В приветственном сообщении будет кнопка, нажав на которую,
# юзер снимет статус и получит роль покупателя и откроет
# для себя меню покупателя.
# Если юзер уже зарегистрован как сотрудник, он попадет в меню выбора:
# открыть меню покупателя или открыть меню сотрудника
# Если юзер уже зарегистрован как владелец, он попадет в меню выбора:
# открыть меню покупателя, открыть меню сотрудника, или открыть меню владельца

